airfoilmesher/example/0/aspectRatio
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      aspectRatio;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
69504
(
7.64598
7.53354
7.42293
7.31411
7.20705
7.10173
6.99811
6.89617
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    farfield
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
