airfoilmesher/example/0/minTetVolume
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      minTetVolume;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
69504
(
4.13569e-07
4.42444e-07
4.73333e-07
5.06375e-07
5.41721e-07
5.7953e-07
6.19974e-07
6.63236e-07
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    farfield
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
