airfoilmesher/example/0/skewness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      skewness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
69504
(
0.219795
0.222861
0.225961
0.229096
0.232265
0.23547
0.23871
0.241985
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    farfield
    {
        type            calculated;
        value           nonuniform List<scalar> 
799
(
0.0078236
0.0156186
0.0258258
0.0376783
0.0505248
0.0639591
0.0777139
0.0916358
...
)
;
    }
    airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
209
(
0.00119728
0.00450818
0.00664566
0.0101946
0.0128927
0.015728
0.0180898
0.0209565
...
)
;
    }
}


// ************************************************************************* //
