airfoilmesher/example/system/ls
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.87488589251 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.87488589251 10.0 0)
    (21.0 10.0 0)
    (21.0 -1.902 0)
    (21.0 -2.002 0)
    (21.0 -2.102 0)
    (1.02300589696 0.0973176690285 0)
    (1.0 0.0 0)
    (1.00366753095 -0.099932723453 0)
    (0.243747259057 0.188261824709 0)
    (0.25 0.0884575 0)
    (0.25 -0.028167 0)
    (0.256252740943 -0.127971324709 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.87488589251 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.87488589251 10.0 1)
    (21.0 10.0 1)
    (21.0 -1.902 1)
    (21.0 -2.002 1)
    (21.0 -2.102 1)
    (1.02300589696 0.0973176690285 1)
    (1.0 0.0 1)
    (1.00366753095 -0.099932723453 1)
    (0.243747259057 0.188261824709 1)
    (0.25 0.0884575 1)
    (0.25 -0.028167 1)
    (0.256252740943 -0.127971324709 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (166 91 1) simpleGrading (13.287942441 56.0574584383 56.0574584383 13.287942441 0.0121628138855 0.0121628138855 0.0121628138855 0.0121628138855 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (73 91 1) simpleGrading (0.804344255555 1.42754502483 1.42754502483 0.804344255555 0.0122783957621 0.0121628138855 0.0121628138855 0.0122783957621 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 91 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.0121628138855 0.0122783957621 0.0122783957621 0.0121628138855 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (91 31 1) edgeGrading (0.0121628138855 0.0123757235742 0.0123757235742 0.0121628138855 0.0125 0.5 0.5 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (69 91 1) edgeGrading (1.54747231104 0.804344255555 0.804344255555 1.54747231104 80.8033561842 82.2178164864 82.2178164864 80.8033561842 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (166 91 1) simpleGrading (56.0574584383 13.287942441 13.287942441 56.0574584383 82.2178164864 82.2178164864 82.2178164864 82.2178164864 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (166 37 1) simpleGrading (56.0574584383 6.08140694277 1) 
    hex (15 12 11 14 34 31 30 33) (69 37 1) egeeGrading (0.8 1.54747231104 1.54747231104 0.8 6.08140694277 6.08140694277 6.08140694277 6.08140694277 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 37 1) edgeGrading (2.0 0.5 0.5 2.0 6.08140694277 6.08140694277 6.08140694277 6.08140694277 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 37 1) edgeGrading (0.5 2.0 2.0 0.5 0.164435632973 0.164435632973 0.164435632973 0.164435632973 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (73 37 1) edgeGrading (1.42754502483 0.8 0.8 1.42754502483 0.164435632973 0.164435632973 0.164435632973 0.164435632973 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (166 37 1) simpleGrading (56.0574584383 0.164435632973 1) 
);

edges
(
    polyLine 11 14
    (
        (1.01300589696 0.100286669029 0)
        (1.00295980576 0.102661553464 0)
        (0.992830668284 0.105045926585 0)
        (0.98252887937 0.107452202985 0)
        (0.962166957204 0.112136183897 0)
        (0.941667720152 0.116740330489 0)
        (0.921190114398 0.121231110565 0)
        (0.900720348801 0.125618786597 0)
        (0.880235057933 0.129905314861 0)
        (0.8597294292 0.134088430806 0)
        (0.839210407005 0.138161455962 0)
        (0.818675546268 0.142124643176 0)
        (0.798127131082 0.145971312527 0)
        (0.77756986427 0.149701399889 0)
        (0.757006118711 0.153310350493 0)
        (0.736438299166 0.156799658964 0)
        (0.715856809579 0.16016780435 0)
        (0.695249533655 0.163414419018 0)
        (0.674587277998 0.166535335694 0)
        (0.653867212701 0.169515834682 0)
        (0.633088918949 0.172345700427 0)
        (0.612254437329 0.175009303537 0)
        (0.591387931742 0.177494459035 0)
        (0.570506526202 0.179794532907 0)
        (0.549620172358 0.181907185801 0)
        (0.528731524107 0.183832073093 0)
        (0.507833355521 0.185569720603 0)
        (0.486898526251 0.187118767905 0)
        (0.465892244779 0.188469256323 0)
        (0.444801954051 0.189602639646 0)
        (0.423630105817 0.190500089938 0)
        (0.402386819835 0.191142511397 0)
        (0.38113992593 0.191514502633 0)
        (0.359967500002 0.191626994719 0)
        (0.338897566999 0.191501923023 0)
        (0.317930443345 0.191164582383 0)
        (0.297041295865 0.190636220766 0)
        (0.276013172273 0.189922494418 0)
        (0.25458047648 0.188937035832 0)
    )
    polyLine 30 33
    (
        (1.01300589696 0.100286669029 1)
        (1.00295980576 0.102661553464 1)
        (0.992830668284 0.105045926585 1)
        (0.98252887937 0.107452202985 1)
        (0.962166957204 0.112136183897 1)
        (0.941667720152 0.116740330489 1)
        (0.921190114398 0.121231110565 1)
        (0.900720348801 0.125618786597 1)
        (0.880235057933 0.129905314861 1)
        (0.8597294292 0.134088430806 1)
        (0.839210407005 0.138161455962 1)
        (0.818675546268 0.142124643176 1)
        (0.798127131082 0.145971312527 1)
        (0.77756986427 0.149701399889 1)
        (0.757006118711 0.153310350493 1)
        (0.736438299166 0.156799658964 1)
        (0.715856809579 0.16016780435 1)
        (0.695249533655 0.163414419018 1)
        (0.674587277998 0.166535335694 1)
        (0.653867212701 0.169515834682 1)
        (0.633088918949 0.172345700427 1)
        (0.612254437329 0.175009303537 1)
        (0.591387931742 0.177494459035 1)
        (0.570506526202 0.179794532907 1)
        (0.549620172358 0.181907185801 1)
        (0.528731524107 0.183832073093 1)
        (0.507833355521 0.185569720603 1)
        (0.486898526251 0.187118767905 1)
        (0.465892244779 0.188469256323 1)
        (0.444801954051 0.189602639646 1)
        (0.423630105817 0.190500089938 1)
        (0.402386819835 0.191142511397 1)
        (0.38113992593 0.191514502633 1)
        (0.359967500002 0.191626994719 1)
        (0.338897566999 0.191501923023 1)
        (0.317930443345 0.191164582383 1)
        (0.297041295865 0.190636220766 1)
        (0.276013172273 0.189922494418 1)
        (0.25458047648 0.188937035832 1)
    )
    polyLine 14 18
    (
        (0.232667293319 0.187561794706 0)
        (0.210268903759 0.185668402616 0)
        (0.187415841322 0.183125034904 0)
        (0.164323742554 0.17983263173 0)
        (0.141255727134 0.175798553338 0)
        (0.118162578618 0.171022510479 0)
        (0.0947505234001 0.16537982602 0)
        (0.0708508193442 0.158655332532 0)
        (0.0464597744132 0.150638501122 0)
        (0.0224458396303 0.141437553726 0)
        (0.00662074083652 0.134376275654 0)
        (-0.00903605431428 0.126279967145 0)
        (-0.0266640719539 0.115418498406 0)
        (-0.0444287505349 0.101852337485 0)
        (-0.0576227108854 0.0896401574555 0)
        (-0.0664975187048 0.0804442175552 0)
        (-0.0757531899234 0.069251677703 0)
        (-0.0846060713025 0.0557968837613 0)
        (-0.0907658685034 0.0434639522965 0)
        (-0.0960838091331 0.0282536254717 0)
        (-0.0977906305576 0.0209043673702 0)
    )
    polyLine 33 37
    (
        (0.232667293319 0.187561794706 1)
        (0.210268903759 0.185668402616 1)
        (0.187415841322 0.183125034904 1)
        (0.164323742554 0.17983263173 1)
        (0.141255727134 0.175798553338 1)
        (0.118162578618 0.171022510479 1)
        (0.0947505234001 0.16537982602 1)
        (0.0708508193442 0.158655332532 1)
        (0.0464597744132 0.150638501122 1)
        (0.0224458396303 0.141437553726 1)
        (0.00662074083652 0.134376275654 1)
        (-0.00903605431428 0.126279967145 1)
        (-0.0266640719539 0.115418498406 1)
        (-0.0444287505349 0.101852337485 1)
        (-0.0576227108854 0.0896401574555 1)
        (-0.0664975187048 0.0804442175552 1)
        (-0.0757531899234 0.069251677703 1)
        (-0.0846060713025 0.0557968837613 1)
        (-0.0907658685034 0.0434639522965 1)
        (-0.0960838091331 0.0282536254717 1)
        (-0.0977906305576 0.0209043673702 1)
    )
    polyLine 18 17
    (
        (-0.0925680330309 -0.0412533463172 0)
        (-0.0892382027167 -0.0490356975724 0)
        (-0.0816024314418 -0.0626802396249 0)
        (-0.0693499168144 -0.0784820348859 0)
        (-0.054824655506 -0.0920874309672 0)
        (-0.032637821243 -0.106457439511 0)
        (-0.00986613916896 -0.115707914263 0)
        (0.00921880397555 -0.120422879381 0)
        (0.0230536990487 -0.123074654849 0)
        (0.0370743481367 -0.125206119013 0)
        (0.0519792581244 -0.126805819497 0)
        (0.0743813896875 -0.12830103132 0)
        (0.0962426550539 -0.129308386864 0)
        (0.117847998481 -0.129939841766 0)
        (0.13927001945 -0.130237335606 0)
        (0.160477494556 -0.130253859988 0)
        (0.181472340388 -0.130038160481 0)
        (0.202259423062 -0.129640471779 0)
        (0.222868818735 -0.129103840925 0)
        (0.243320667662 -0.128462850624 0)
    )
    polyLine 37 36
    (
        (-0.0925680330309 -0.0412533463172 1)
        (-0.0892382027167 -0.0490356975724 1)
        (-0.0816024314418 -0.0626802396249 1)
        (-0.0693499168144 -0.0784820348859 1)
        (-0.054824655506 -0.0920874309672 1)
        (-0.032637821243 -0.106457439511 1)
        (-0.00986613916896 -0.115707914263 1)
        (0.00921880397555 -0.120422879381 1)
        (0.0230536990487 -0.123074654849 1)
        (0.0370743481367 -0.125206119013 1)
        (0.0519792581244 -0.126805819497 1)
        (0.0743813896875 -0.12830103132 1)
        (0.0962426550539 -0.129308386864 1)
        (0.117847998481 -0.129939841766 1)
        (0.13927001945 -0.130237335606 1)
        (0.160477494556 -0.130253859988 1)
        (0.181472340388 -0.130038160481 1)
        (0.202259423062 -0.129640471779 1)
        (0.222868818735 -0.129103840925 1)
        (0.243320667662 -0.128462850624 1)
    )
    polyLine 17 13
    (
        (0.263617630432 -0.127750542327 0)
        (0.283767323721 -0.126999011163 0)
        (0.303782291672 -0.126236445749 0)
        (0.323722418351 -0.125486693991 0)
        (0.343670025905 -0.124750631857 0)
        (0.363640086003 -0.124020726909 0)
        (0.383630105817 -0.123295089938 0)
        (0.403640086003 -0.122567726909 0)
        (0.423655056077 -0.121837180501 0)
        (0.443670025905 -0.121103631857 0)
        (0.463677510726 -0.120367356696 0)
        (0.483680005653 -0.119631264852 0)
        (0.503680005653 -0.118894264852 0)
        (0.523675015793 -0.118158448479 0)
        (0.543670025905 -0.117423631857 0)
        (0.563667530951 -0.116689723453 0)
        (0.583667530951 -0.115955723453 0)
        (0.603667530951 -0.115221723453 0)
        (0.623667530951 -0.114487723453 0)
        (0.643670025905 -0.113753631857 0)
        (0.663672520852 -0.113018540199 0)
        (0.683670025905 -0.112283631857 0)
        (0.703670025905 -0.111549631857 0)
        (0.723670025905 -0.110814631857 0)
        (0.743670025905 -0.110080631857 0)
        (0.763670025905 -0.109345631857 0)
        (0.783670025905 -0.108611631857 0)
        (0.803670025905 -0.107876631857 0)
        (0.823670025905 -0.107142631857 0)
        (0.843670025905 -0.106407631857 0)
        (0.863670025905 -0.105673631857 0)
        (0.883670025905 -0.104938631857 0)
        (0.903670025905 -0.104204631857 0)
        (0.923670025905 -0.103469631857 0)
        (0.943670025905 -0.102735631857 0)
        (0.963670857555 -0.102000601311 0)
        (0.973667530951 -0.101633723453 0)
        (0.983667530951 -0.101266723453 0)
        (0.993667530951 -0.100899723453 0)
    )
    polyLine 36 32
    (
        (0.263617630432 -0.127750542327 1)
        (0.283767323721 -0.126999011163 1)
        (0.303782291672 -0.126236445749 1)
        (0.323722418351 -0.125486693991 1)
        (0.343670025905 -0.124750631857 1)
        (0.363640086003 -0.124020726909 1)
        (0.383630105817 -0.123295089938 1)
        (0.403640086003 -0.122567726909 1)
        (0.423655056077 -0.121837180501 1)
        (0.443670025905 -0.121103631857 1)
        (0.463677510726 -0.120367356696 1)
        (0.483680005653 -0.119631264852 1)
        (0.503680005653 -0.118894264852 1)
        (0.523675015793 -0.118158448479 1)
        (0.543670025905 -0.117423631857 1)
        (0.563667530951 -0.116689723453 1)
        (0.583667530951 -0.115955723453 1)
        (0.603667530951 -0.115221723453 1)
        (0.623667530951 -0.114487723453 1)
        (0.643670025905 -0.113753631857 1)
        (0.663672520852 -0.113018540199 1)
        (0.683670025905 -0.112283631857 1)
        (0.703670025905 -0.111549631857 1)
        (0.723670025905 -0.110814631857 1)
        (0.743670025905 -0.110080631857 1)
        (0.763670025905 -0.109345631857 1)
        (0.783670025905 -0.108611631857 1)
        (0.803670025905 -0.107876631857 1)
        (0.823670025905 -0.107142631857 1)
        (0.843670025905 -0.106407631857 1)
        (0.863670025905 -0.105673631857 1)
        (0.883670025905 -0.104938631857 1)
        (0.903670025905 -0.104204631857 1)
        (0.923670025905 -0.103469631857 1)
        (0.943670025905 -0.102735631857 1)
        (0.963670857555 -0.102000601311 1)
        (0.973667530951 -0.101633723453 1)
        (0.983667530951 -0.101266723453 1)
        (0.993667530951 -0.100899723453 1)
    )
    spline 12 15
    (
        (0.99 0.002969 0)
        (0.98 0.005333 0)
        (0.97 0.007687 0)
        (0.96 0.010023 0)
        (0.94 0.014624 0)
        (0.92 0.019116 0)
        (0.9 0.023502 0)
        (0.88 0.027789 0)
        (0.86 0.031974 0)
        (0.84 0.036054 0)
        (0.82 0.040024 0)
        (0.8 0.043884 0)
        (0.78 0.047628 0)
        (0.76 0.051257 0)
        (0.74 0.054767 0)
        (0.72 0.05816 0)
        (0.7 0.061433 0)
        (0.68 0.064584 0)
        (0.66 0.067605 0)
        (0.64 0.070482 0)
        (0.62 0.073206 0)
        (0.6 0.075763 0)
        (0.58 0.078145 0)
        (0.56 0.080348 0)
        (0.54 0.082371 0)
        (0.52 0.084214 0)
        (0.5 0.085877 0)
        (0.48 0.087357 0)
        (0.46 0.088643 0)
        (0.44 0.089718 0)
        (0.42 0.090566 0)
        (0.4 0.091171 0)
        (0.38 0.091521 0)
        (0.36 0.091627 0)
        (0.34 0.091508 0)
        (0.32 0.091186 0)
        (0.3 0.09068 0)
        (0.28 0.090002 0)
        (0.26 0.089084 0)
    )
    spline 31 34
    (
        (0.99 0.002969 1)
        (0.98 0.005333 1)
        (0.97 0.007687 1)
        (0.96 0.010023 1)
        (0.94 0.014624 1)
        (0.92 0.019116 1)
        (0.9 0.023502 1)
        (0.88 0.027789 1)
        (0.86 0.031974 1)
        (0.84 0.036054 1)
        (0.82 0.040024 1)
        (0.8 0.043884 1)
        (0.78 0.047628 1)
        (0.76 0.051257 1)
        (0.74 0.054767 1)
        (0.72 0.05816 1)
        (0.7 0.061433 1)
        (0.68 0.064584 1)
        (0.66 0.067605 1)
        (0.64 0.070482 1)
        (0.62 0.073206 1)
        (0.6 0.075763 1)
        (0.58 0.078145 1)
        (0.56 0.080348 1)
        (0.54 0.082371 1)
        (0.52 0.084214 1)
        (0.5 0.085877 1)
        (0.48 0.087357 1)
        (0.46 0.088643 1)
        (0.44 0.089718 1)
        (0.42 0.090566 1)
        (0.4 0.091171 1)
        (0.38 0.091521 1)
        (0.36 0.091627 1)
        (0.34 0.091508 1)
        (0.32 0.091186 1)
        (0.3 0.09068 1)
        (0.28 0.090002 1)
        (0.26 0.089084 1)
    )
    arc 4 5 (-7.07107250279 7.07106312094 0)
    arc 3 4 (-7.07107250279 -7.07106312094 0)
    arc 23 24 (-7.07107250279 7.07106312094 1)
    arc 22 23 (-7.07107250279 -7.07106312094 1)
    spline 15 0
    (
        (0.24 0.087831 0)
        (0.22 0.086143 0)
        (0.2 0.08392 0)
        (0.18 0.081069 0)
        (0.16 0.077571 0)
        (0.14 0.073436 0)
        (0.12 0.06862 0)
        (0.1 0.062998 0)
        (0.08 0.056431 0)
        (0.06 0.048757 0)
        (0.05 0.044275 0)
        (0.04 0.039128 0)
        (0.03 0.033022 0)
        (0.02 0.025374 0)
        (0.012 0.017858 0)
        (0.008 0.013735 0)
        (0.004 0.008924 0)
        (0.002 0.005803 0)
        (0.001 0.003727 0)
        (0.0005 0.002339 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.24 0.087831 1)
        (0.22 0.086143 1)
        (0.2 0.08392 1)
        (0.18 0.081069 1)
        (0.16 0.077571 1)
        (0.14 0.073436 1)
        (0.12 0.06862 1)
        (0.1 0.062998 1)
        (0.08 0.056431 1)
        (0.06 0.048757 1)
        (0.05 0.044275 1)
        (0.04 0.039128 1)
        (0.03 0.033022 1)
        (0.02 0.025374 1)
        (0.012 0.017858 1)
        (0.008 0.013735 1)
        (0.004 0.008924 1)
        (0.002 0.005803 1)
        (0.001 0.003727 1)
        (0.0005 0.002339 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.0005 -0.00467 0)
        (0.001 -0.005942 0)
        (0.002 -0.007811 0)
        (0.004 -0.010513 0)
        (0.008 -0.014286 0)
        (0.012 -0.016973 0)
        (0.02 -0.020272 0)
        (0.03 -0.022606 0)
        (0.04 -0.024521 0)
        (0.05 -0.026045 0)
        (0.06 -0.027128 0)
        (0.08 -0.028459 0)
        (0.1 -0.029379 0)
        (0.12 -0.029963 0)
        (0.14 -0.03024 0)
        (0.16 -0.030255 0)
        (0.18 -0.030049 0)
        (0.2 -0.029666 0)
        (0.22 -0.029145 0)
        (0.24 -0.028518 0)
    )
    spline 19 35
    (
        (0.0005 -0.00467 1)
        (0.001 -0.005942 1)
        (0.002 -0.007811 1)
        (0.004 -0.010513 1)
        (0.008 -0.014286 1)
        (0.012 -0.016973 1)
        (0.02 -0.020272 1)
        (0.03 -0.022606 1)
        (0.04 -0.024521 1)
        (0.05 -0.026045 1)
        (0.06 -0.027128 1)
        (0.08 -0.028459 1)
        (0.1 -0.029379 1)
        (0.12 -0.029963 1)
        (0.14 -0.03024 1)
        (0.16 -0.030255 1)
        (0.18 -0.030049 1)
        (0.2 -0.029666 1)
        (0.22 -0.029145 1)
        (0.24 -0.028518 1)
    )
    spline 16 12
    (
        (0.26 -0.027816 0)
        (0.28 -0.02707 0)
        (0.3 -0.026308 0)
        (0.32 -0.025556 0)
        (0.34 -0.024818 0)
        (0.36 -0.024087 0)
        (0.38 -0.023361 0)
        (0.4 -0.022634 0)
        (0.42 -0.021904 0)
        (0.44 -0.021171 0)
        (0.46 -0.020435 0)
        (0.48 -0.019699 0)
        (0.5 -0.018962 0)
        (0.52 -0.018226 0)
        (0.54 -0.017491 0)
        (0.56 -0.016757 0)
        (0.58 -0.016023 0)
        (0.6 -0.015289 0)
        (0.62 -0.014555 0)
        (0.64 -0.013821 0)
        (0.66 -0.013086 0)
        (0.68 -0.012351 0)
        (0.7 -0.011617 0)
        (0.72 -0.010882 0)
        (0.74 -0.010148 0)
        (0.76 -0.009413 0)
        (0.78 -0.008679 0)
        (0.8 -0.007944 0)
        (0.82 -0.00721 0)
        (0.84 -0.006475 0)
        (0.86 -0.005741 0)
        (0.88 -0.005006 0)
        (0.9 -0.004272 0)
        (0.92 -0.003537 0)
        (0.94 -0.002803 0)
        (0.96 -0.002068 0)
        (0.97 -0.001701 0)
        (0.98 -0.001334 0)
        (0.99 -0.000967 0)
    )
    spline 35 31
    (
        (0.26 -0.027816 1)
        (0.28 -0.02707 1)
        (0.3 -0.026308 1)
        (0.32 -0.025556 1)
        (0.34 -0.024818 1)
        (0.36 -0.024087 1)
        (0.38 -0.023361 1)
        (0.4 -0.022634 1)
        (0.42 -0.021904 1)
        (0.44 -0.021171 1)
        (0.46 -0.020435 1)
        (0.48 -0.019699 1)
        (0.5 -0.018962 1)
        (0.52 -0.018226 1)
        (0.54 -0.017491 1)
        (0.56 -0.016757 1)
        (0.58 -0.016023 1)
        (0.6 -0.015289 1)
        (0.62 -0.014555 1)
        (0.64 -0.013821 1)
        (0.66 -0.013086 1)
        (0.68 -0.012351 1)
        (0.7 -0.011617 1)
        (0.72 -0.010882 1)
        (0.74 -0.010148 1)
        (0.76 -0.009413 1)
        (0.78 -0.008679 1)
        (0.8 -0.007944 1)
        (0.82 -0.00721 1)
        (0.84 -0.006475 1)
        (0.86 -0.005741 1)
        (0.88 -0.005006 1)
        (0.9 -0.004272 1)
        (0.92 -0.003537 1)
        (0.94 -0.002803 1)
        (0.96 -0.002068 1)
        (0.97 -0.001701 1)
        (0.98 -0.001334 1)
        (0.99 -0.000967 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
